/********** AFP/SMB Login Error Messages *********/

/* Format string used to build primary message string of alert that is presented when an error occurs mounting an AFP or SMB home directory. */
/* %@ is replaced with the name of the user account. */

"AFP_SMB_LOGIN_ERROR_MESSAGE_FORMAT" = "Käyttäjätunnukselle ”%@” kirjautuminen ei nyt ole mahdollista";

/* Info string (secondary message) of alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"AFP_SMB_LOGIN_ERROR_INFO" = "Kirjautuminen tunnukselle epäonnistui virheen takia. Käyttäjätunnuksen kotikansio sijaitsee AFP- tai SMB-palvelimella. Lisätietoja saat järjestelmän ylläpitäjältä.";

/* Label for OK button in alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"AFP_SMB_LOGIN_ERROR_OK_BUTTON" = "OK";


/********** FileVault Login Error Messages *********/

/* Format string used to build primary message string of alert that is presented when an error occurs mounting a FileVault home directory. */
/* %@ is replaced with the name of the user account. */
"FILEVAULT_LOGIN_ERROR_MESSAGE_FORMAT" = "Et voi kirjautua FileVault-tunnukselle ”%@” tällä hetkellä";

/* Info string (secondary message) of alert that is presented when an error ocurs mounting a FileVault Image */
"FILEVAULT_LOGIN_ERROR_INFO" = "Tunnukselle kirjautuminen epäonnistui, koska tapahtui virhe.";

/* Label for OK button in alert that is presented when an error ocurs mounting a FileVault Image */
"FILEVAULT_LOGIN_ERROR_OK_BUTTON" = "OK";


/********** Network Login Error Messages *********/

/* Format string used to build primary message string of alert that is presented when an error occurs mounting a Network home. */
/* %@ is replaced with the name of the user account. */

"NETWORK_LOGIN_ERROR_MESSAGE_FORMAT" = "Käyttäjätunnukselle ”%@” kirjautuminen ei nyt ole mahdollista";

/* Info string (secondary message) of alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"NETWORK_LOGIN_ERROR_INFO" = "Tunnukselle kirjautuminen epäonnistui, koska tapahtui virhe.";

/* Label for OK button in alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"NETWORK_LOGIN_ERROR_OK_BUTTON" = "OK";


/********** Network Login Error Messages *********/

/* Format string used to build primary message string of alert that is presented when an error occurs mounting a Network home. */
/* %@ is replaced with the name of the user account. */

"DEFAULT_LOGIN_ERROR_MESSAGE_FORMAT" = "Käyttäjätunnukselle ”%@” kirjautuminen ei nyt ole mahdollista";

/* Info string (secondary message) of alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"DEFAULT_LOGIN_ERROR_INFO" = "Tunnukselle kirjautuminen epäonnistui, koska tapahtui virhe.";

/* Label for OK button in alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"DEFAULT_LOGIN_ERROR_OK_BUTTON" = "OK";
